; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v3 - type_3 ?v8 - type_1)
 	      (pred_2 ?v6 - object ?v8 - type_1)
	      (pred_3 ?v3 - type_3 ?v5 - type_2)
	      (pred_4 ?v3 - type_3 ?v6 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v3 - type_3 ?v2 ?v7 - type_1)
       :precondition (and  (pred_1 ?v3 ?v2))
       :effect (and  (pred_1 ?v3 ?v7)
		     (not (pred_1 ?v3 ?v2))))

   (:action op_3
       :parameters (?v3 - type_3 ?v4 - object ?v1 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v1) (pred_1 ?v3 ?v1) (pred_3 ?v3 ?v5))
       :effect (and (pred_4 ?v3 ?v4 ?v5)
		    (not (pred_2 ?v4 ?v1)) 
		    (not (pred_3 ?v3 ?v5))))

   (:action op_2
       :parameters (?v3 - type_3 ?v4 - object ?v1 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v4 ?v5) (pred_1 ?v3 ?v1))
       :effect (and (pred_2 ?v4 ?v1)
		    (pred_3 ?v3 ?v5)
		    (not (pred_4 ?v3 ?v4 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_02 - type_1
obj_04 obj_01 obj_13 obj_12 - type_2
obj_11 obj_07 obj_06 obj_08 - type_3
obj_05 obj_09 obj_03 - object)
(:init
(pred_1 obj_10 obj_08)
(pred_3 obj_10 obj_04)
(pred_3 obj_10 obj_01)
(pred_1 obj_02 obj_07)
(pred_3 obj_02 obj_13)
(pred_3 obj_02 obj_12)
(pred_2 obj_05 obj_07)
(pred_2 obj_09 obj_08)
(pred_2 obj_03 obj_06)
)
(:goal
(and
(pred_2 obj_05 obj_11)
(pred_2 obj_09 obj_07)
(pred_2 obj_03 obj_06)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_10 obj_07) (pred_1 obj_02 obj_07))))
  )
)
)

; plan
1. (op_3 obj_02 obj_05 obj_07 obj_12)
   deleted: (pred_2 obj_05 obj_07) (pred_3 obj_02 obj_12)
   added: (pred_4 obj_02 obj_05 obj_12)
   goals met: 1 of 3
2. (op_3 obj_10 obj_09 obj_08 obj_01)
   deleted: (pred_2 obj_09 obj_08) (pred_3 obj_10 obj_01)
   added: (pred_4 obj_10 obj_09 obj_01)
   goals met: 1 of 3
3. (op_1 obj_02 obj_07 obj_11)
   deleted: (pred_1 obj_02 obj_07)
   added: (pred_1 obj_02 obj_11)
   goals met: 1 of 3
4. (op_1 obj_10 obj_08 obj_07)
   deleted: (pred_1 obj_10 obj_08)
   added: (pred_1 obj_10 obj_07)
   goals met: 1 of 3
5. (op_2 obj_10 obj_09 obj_07 obj_01)
   deleted: (pred_4 obj_10 obj_09 obj_01)
   added: (pred_2 obj_09 obj_07) (pred_3 obj_10 obj_01)
   goals met: 2 of 3
6. (op_2 obj_02 obj_05 obj_11 obj_12)
   deleted: (pred_4 obj_02 obj_05 obj_12)
   added: (pred_2 obj_05 obj_11) (pred_3 obj_02 obj_12)
   goals met: 3 of 3
